Rahix/avr-device/vendor/attiny84.atdf
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt index="0" name="RESET" caption="External Pin, Power-on Reset, Brown-out Reset,Watchdog Reset"/>
        <interrupt index="1" name="EXT_INT0" caption="External Interrupt Request 0"/>
        <interrupt index="2" name="PCINT0" caption="Pin Change Interrupt Request 0"/>
        <interrupt index="3" name="PCINT1" caption="Pin Change Interrupt Request 1"/>
        <interrupt index="4" name="WDT" caption="Watchdog Time-out"/>
        <interrupt index="5" name="TIM1_CAPT" caption="Timer/Counter1 Capture Event"/>
        <interrupt index="6" name="TIM1_COMPA" caption="Timer/Counter1 Compare Match A"/>
        <interrupt index="7" name="TIM1_COMPB" caption="Timer/Counter1 Compare Match B"/>
        <interrupt index="8" name="TIM1_OVF" caption="Timer/Counter1 Overflow"/>
        <interrupt index="9" name="TIM0_COMPA" caption="Timer/Counter0 Compare Match A"/>
        <interrupt index="10" name="TIM0_COMPB" caption="Timer/Counter0 Compare Match B"/>
        <interrupt index="11" name="TIM0_OVF" caption="Timer/Counter0 Overflow"/>
        <interrupt index="12" name="ANA_COMP" caption="Analog Comparator"/>
        <interrupt index="13" name="ADC" caption="ADC Conversion Complete"/>
        <interrupt index="14" name="EE_RDY" caption="EEPROM Ready"/>
        <interrupt index="15" name="USI_STR" caption="USI START"/>
        <interrupt index="16" name="USI_OVF" caption="USI Overflow"/>
      </interrupts>
      <interfaces>
        <interface name="ISP" type="isp"/>
        <interface name="HVSP" type="hvsp"/>
        <interface name="debugWIRE" type="dw"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x930C"/>
          <property name="SIGNATURE0" value="0x1e"/>
          <property name="SIGNATURE1" value="0x93"/>
          <property name="SIGNATURE2" value="0x0c"/>
        </property-group>
        <property-group name="OCD">
          <property name="OCD_REVISION" value="1"/>
          <property name="OCD_DATAREG" value="0x27"/>
          <property name="PROGBASE" value="0x0000"/>
        </property-group>
        <property-group name="JTAG_INTERFACE">
          <property name="ALLOWFULLPAGESTREAM" value="0x00"/>
        </property-group>
        <property-group name="ISP_INTERFACE">
          <property name="IspEnterProgMode_timeout" value="200"/>
          <property name="IspEnterProgMode_stabDelay" value="100"/>
          <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
          <property name="IspEnterProgMode_synchLoops" value="32"/>
          <property name="IspEnterProgMode_byteDelay" value="0"/>
          <property name="IspEnterProgMode_pollIndex" value="3"/>
          <property name="IspEnterProgMode_pollValue" value="0x53"/>
          <property name="IspLeaveProgMode_preDelay" value="1"/>
          <property name="IspLeaveProgMode_postDelay" value="1"/>
          <property name="IspChipErase_eraseDelay" value="45"/>
          <property name="IspChipErase_pollMethod" value="1"/>
          <property name="IspProgramFlash_mode" value="0x41"/>
          <property name="IspProgramFlash_blockSize" value="64"/>
          <property name="IspProgramFlash_delay" value="10"/>
          <property name="IspProgramFlash_cmd1" value="0x40"/>
          <property name="IspProgramFlash_cmd2" value="0x4C"/>
          <property name="IspProgramFlash_cmd3" value="0x00"/>
          <property name="IspProgramFlash_pollVal1" value="0x00"/>
          <property name="IspProgramFlash_pollVal2" value="0x00"/>
          <property name="IspProgramEeprom_mode" value="0x41"/>
          <property name="IspProgramEeprom_blockSize" value="4"/>
          <property name="IspProgramEeprom_delay" value="10"/>
          <property name="IspProgramEeprom_cmd1" value="0xC1"/>
          <property name="IspProgramEeprom_cmd2" value="0xC2"/>
          <property name="IspProgramEeprom_cmd3" value="0x00"/>
          <property name="IspProgramEeprom_pollVal1" value="0x00"/>
          <property name="IspProgramEeprom_pollVal2" value="0x00"/>
          <property name="IspReadFlash_blockSize" value="256"/>
          <property name="IspReadEeprom_blockSize" value="256"/>
          <property name="IspReadFuse_pollIndex" value="4"/>
          <property name="IspReadLock_pollIndex" value="4"/>
          <property name="IspReadSign_pollIndex" value="4"/>
          <property name="IspReadOsccal_pollIndex" value="4"/>
        </property-group>
        <property-group name="HVSP_INTERFACE">
          <property name="HvspControlStack" value="0x4C 0x0C 0x1C 0x2C 0x3C 0x64 0x74 0x66 0x68 0x78 0x68 0x68 0x7A 0x6A 0x68 0x78 0x78 0x7D 0x6D 0x0C 0x80 0x40 0x20 0x10 0x11 0x08 0x04 0x02 0x03 0x08 0x04 0x0F"/>
          <property name="HvspEnterProgMode_stabDelay" value="100"/>
          <property name="HvspEnterProgMode_cmdexeDelay" value="50"/>
          <property name="HvspEnterProgMode_synchCycles" value="6"/>
          <property name="HvspEnterProgMode_latchCycles" value="1"/>
          <property name="HvspEnterProgMode_toggleVtg" value="1"/>
          <property name="HvspEnterProgMode_powoffDelay" value="50"/>
          <property name="HvspEnterProgMode_resetDelay1" value="0"/>
          <property name="HvspEnterProgMode_resetDelay2" value="3"/>
          <property name="HvspLeaveProgMode_stabDelay" value="100"/>
          <property name="HvspLeaveProgMode_resetDelay" value="25"/>
          <property name="HvspChipErase_pollTimeout" value="40"/>
          <property name="HvspChipErase_eraseTime" value="0"/>
          <property name="HvspProgramFlash_mode" value="0x0D"/>
          <property name="HvspProgramFlash_blockSize" value="256"/>
          <property name="HvspProgramFlash_pollTimeout" value="5"/>
          <property name="HvspReadFlash_blockSize" value="256"/>
          <property name="HvspProgramEeprom_mode" value="0x05"/>
          <property name="HvspProgramEeprom_blockSize" value="256"/>
          <property name="HvspProgramEeprom_pollTimeout" value="5"/>
          <property name="HvspReadEeprom_blockSize" value="256"/>
          <property name="HvspProgramFuse_pollTimeout" value="25"/>
          <property name="HvspProgramLock_pollTimeout" value="25"/>
        </property-group>
        <property-group name="ISP_INTERFACE_STK600">
          <property name="IspEnterProgMode_timeout" value="200"/>
          <property name="IspEnterProgMode_stabDelay" value="100"/>
          <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
          <property name="IspEnterProgMode_synchLoops" value="32"/>
          <property name="IspEnterProgMode_byteDelay" value="0"/>
          <property name="IspEnterProgMode_pollIndex" value="3"/>
          <property name="IspEnterProgMode_pollValue" value="0x53"/>
          <property name="IspLeaveProgMode_preDelay" value="1"/>
          <property name="IspLeaveProgMode_postDelay" value="1"/>
          <property name="IspChipErase_eraseDelay" value="45"/>
          <property name="IspChipErase_pollMethod" value="1"/>
          <property name="IspProgramFlash_mode" value="0x41"/>
          <property name="IspProgramFlash_blockSize" value="64"/>
          <property name="IspProgramFlash_delay" value="6"/>
          <property name="IspProgramFlash_cmd1" value="0x40"/>
          <property name="IspProgramFlash_cmd2" value="0x4C"/>
          <property name="IspProgramFlash_cmd3" value="0x00"/>
          <property name="IspProgramFlash_pollVal1" value="0x00"/>
          <property name="IspProgramFlash_pollVal2" value="0x00"/>
          <property name="IspProgramEeprom_mode" value="0x41"/>
          <property name="IspProgramEeprom_blockSize" value="4"/>
          <property name="IspProgramEeprom_delay" value="5"/>
          <property name="IspProgramEeprom_cmd1" value="0xC1"/>
          <property name="IspProgramEeprom_cmd2" value="0xC2"/>
          <property name="IspProgramEeprom_cmd3" value="0x00"/>
          <property name="IspProgramEeprom_pollVal1" value="0x00"/>
          <property name="IspProgramEeprom_pollVal2" value="0x00"/>
          <property name="IspReadFlash_blockSize" value="256"/>
          <property name="IspReadEeprom_blockSize" value="256"/>
          <property name="IspReadFuse_pollIndex" value="4"/>
          <property name="IspReadLock_pollIndex" value="4"/>
          <property name="IspReadSign_pollIndex" value="4"/>
          <property name="IspReadOsccal_pollIndex" value="4"/>
        </property-group>
        <property-group name="HVSP_INTERFACE_STK600">
          <property name="HvspControlStack" value="0x4C 0x0C 0x1C 0x2C 0x3C 0x64 0x74 0x66 0x68 0x78 0x68 0x68 0x7A 0x6A 0x68 0x78 0x78 0x7D 0x6D 0x0C 0x80 0x40 0x20 0x10 0x11 0x08 0x04 0x02 0x03 0x08 0x04 0x0F"/>
          <property name="HvspEnterProgMode_stabDelay" value="100"/>
          <property name="HvspEnterProgMode_cmdexeDelay" value="50"/>
          <property name="HvspEnterProgMode_synchCycles" value="6"/>
          <property name="HvspEnterProgMode_latchCycles" value="1"/>
          <property name="HvspEnterProgMode_toggleVtg" value="1"/>
          <property name="HvspEnterProgMode_powoffDelay" value="150"/>
          <property name="HvspEnterProgMode_resetDelay1" value="0"/>
          <property name="HvspEnterProgMode_resetDelay2" value="3"/>
          <property name="HvspLeaveProgMode_stabDelay" value="100"/>
          <property name="HvspLeaveProgMode_resetDelay" value="25"/>
          <property name="HvspChipErase_pollTimeout" value="40"/>
          <property name="HvspChipErase_eraseTime" value="0"/>
          <property name="HvspProgramFlash_mode" value="0x0D"/>
          <property name="HvspProgramFlash_blockSize" value="256"/>
          <property name="HvspProgramFlash_pollTimeout" value="5"/>
          <property name="HvspReadFlash_blockSize" value="256"/>
          <property name="HvspProgramEeprom_mode" value="0x05"/>
          <property name="HvspProgramEeprom_blockSize" value="256"/>
          <property name="HvspProgramEeprom_pollTimeout" value="5"/>
          <property name="HvspReadEeprom_blockSize" value="256"/>
          <property name="HvspProgramFuse_pollTimeout" value="25"/>
          <property name="HvspProgramLock_pollTimeout" value="25"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="Fuses" name="FUSE">
      <register-group caption="Fuses" name="FUSE">
        <register caption="" name="EXTENDED" offset="0x02" size="1" initval="0xFF">
          <bitfield caption="Self Programming enable" mask="0x01" name="SELFPRGEN"/>
        </register>
        <register caption="" name="HIGH" offset="0x01" size="1" initval="0xDF">
          <bitfield caption="Reset Disabled (Enable PB3 as i/o pin)" mask="0x80" name="RSTDISBL"/>
          <bitfield caption="Debug Wire enable" mask="0x40" name="DWEN"/>
          <bitfield caption="Serial program downloading (SPI) enabled" mask="0x20" name="SPIEN"/>
          <bitfield caption="Watch-dog Timer always on" mask="0x10" name="WDTON"/>
          <bitfield caption="Preserve EEPROM through the Chip Erase cycle" mask="0x08" name="EESAVE"/>
          <bitfield caption="Brown-out Detector trigger level" mask="0x07" name="BODLEVEL" values="ENUM_BODLEVEL"/>
        </register>
